{"data":{"site":{"siteMetadata":{"title":"Stephen Quick"}},"allMarkdownRemark":{"edges":[{"node":{"html":"<ul>\n<li>Developed and maintain external facing website <a href=\"http://app.dao.hctx.net\">http://app.dao.hctx.net</a>, a lemp stack using Drupal 8, Ubuntu, Nginx, and PHP.</li>\n<li>Created drag and drop file uploading implementation for Asset Forfeiture cms. Used for uploading files associated to cases in Asset Forfeiture department. Used jquery, css and html5fileuploader.js</li>\n<li>Maintain and troubleshoot bugs on existing projects.</li>\n<li>Participate in scrum and weekly deployments for projects.</li>\n<li>Migrated 60+ dbs from 2008 sql server to new 2012/2017 sql server using backup/restore in ssms, and the database migration assistant</li>\n<li>Migrated 20+ web applications from aging windows server 2008 to windows server 2016 to improve responsiveness and security, as well as creating individual ad users for running each of the applications.</li>\n<li>Planned and developed migration plan for Public Integrity coldfusion application to asp.net core api project, with asp.net core mvc.</li>\n</ul>\n<p>Tools used: C#, ASP.NET, SQL, Server administration, AD, RDC, Ubuntu, PHP, Nginx, Mysql</p>","frontmatter":{"startdate":"04/2018","enddate":null,"title":"Software Developer"}}},{"node":{"html":"<ul>\n<li>Developed ReactJS application for reserving rooms at Oxford College for use with iPad</li>\n<li>Developed application for Organic farm to manage customers and seasons which is used by 60 customers.</li>\n<li>Providing technical support for Faculty, Staff and the Students of Oxford College by providing troubleshooting and performance/security analysis for applications and websites</li>\n<li>Consulting with Oxford IT Management and Oxford Staff to development applications for on-campus use</li>\n<li>Created application for Organic Farm for managing student sign ups for work used by over 20 students in this semester.</li>\n<li>Migrated third party payments system Firstdata, used for our financial applications, to Payeezy for continued support in our applications. </li>\n<li>Developed group fitness application for Oxford College community to enroll in fitness classes and manage their schedules.</li>\n</ul>\n<p>Tools used: Coldfusion, HTML, CSS, Javascript, jQuery, ReactJS, Vagrant, MySQL/MariaDB, Webpack</p>","frontmatter":{"startdate":"01/2017","enddate":"04/2018","title":"Application Analyst/Developer, Senior"}}},{"node":{"html":"<ul>\n<li>Providing web support and development to Student Affairs departments such as UA Online, Advising Resource Center, VETs, and the Student Union.</li>\n<li>Development and maintenance of Student Elections application, with an average of 4000 students per election using AngularJS and PHP.</li>\n<li>Migration of older projects into source control, and maintenance of legacy projects to find glaring security vulnerabilities</li>\n<li>Taking a more visible role in dealing with client needs by directly answering questions and miscellaneous project tasks</li>\n<li>Server administration of several Linux machines responsible for hosting applications for students</li>\n<li>Migrated Degree Search from outdated Drupal installation to custom php solution</li>\n<li>Developed custom Drupal 7 module for advising.arizona.edu for use with UITS SOAP Feed to import XML data to Drupal nodes</li>\n<li>Helped create multiple versions of email based templates for mass email distribution</li>\n<li>Created Union Application Administration panel for Student Union Hiring App using php and bootstrap CSS</li>\n</ul>\n<p>Tools used: PHP, Javascript, AngularJS, HTML, CSS, Nginx/Apache, Linux, AWS, Vagrant, MySQL/MariaDB, Webpack</p>","frontmatter":{"startdate":"08/2012","enddate":"10/2016","title":"Web Developer, Senior"}}},{"node":{"html":"<ul>\n<li>Software/Hardware Installation</li>\n<li>Network Troubleshooting</li>\n<li>Supporting Faculty/Staff/Student computers</li>\n<li>Providing Campus support and helping around campus such as offices and classrooms</li>\n<li>Replacing parts on computers such as the Monitor, Memory, or Hard Drives</li>\n<li>Filling out tickets to keep a detailed history of every client.</li>\n<li>Ensuring quality customer service</li>\n<li>Maintaining Inventory of Faculty machines, Imaging computers.</li>\n</ul>","frontmatter":{"startdate":"11/2010","enddate":"07/2012","title":"Technical Analyst"}}}]}},"pageContext":{}}