{"data":{"site":{"siteMetadata":{"title":"Stephen Quick","author":"Stephen Quick"}},"markdownRemark":{"id":"077fea4c-bc06-5b2d-a285-3ef503cfb96d","html":"<blockquote>\n<h2>Update: 3/3/2015:</h2>\n<p>I can confirm that this does in fact work with homestead and elixir. However, I notice that the server hangs at provisioning on terminal. It doesn’t freeze, it continues to load, but it is one little weirdness that I’ve found. Again, server still works, this is likely a ruby issue.</p>\n</blockquote>\n<p>I’ve been looking using grunt/gulp for automation of my different tasks, such as css/js minification, and image manipulations so when I found out about automating tests for phpunit, I decided to give a try.</p>\n<p>Note: I haven’t really seen anything relating to this other than <a href=\"http://jpbetley.com/vagrant-gulp-notifications/\">this</a>, but I couldn’t quite get it to work using his bash script, so I ended up a making a few adjustments to his.</p>\n<p>I develop using a Vagrant VM, so while installing most of this stuff on the host machine will work fine, I want it to be mostly kept to the VM. The tests are also running against the VM’s databases, not the local machine, so it makes more sense to keep dev separate from the Host Mac OSX.</p>\n<h4>[1] Install terminal-notifier</h4>\n<p>I used homebrew, so I just ran update and installed terminal-notifier:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\">\n      <pre class=\"language-text\"><code class=\"language-text\">brew update &amp;&amp; brew install terminal-notifier</code></pre>\n      </div>\n<p>This added terminal-notifier to my applications folder, it also linked the app to my $PATH, which allows me to call it from the terminal.</p>\n<h4>[2] Install Vagrant-Notify</h4>\n<p>I will be using terminal-notifier for this, since it’s the stock notification app for Mac. This piece was a bit weird when initially installing. It worked best for me when I installed the plugin with the Vagrant vm off, it will give me an error about ruby running if the machine was already running. Killing the rogue ruby task with activity monitor would fix this as well.</p>\n<p>From inside the folder with your Vagrant:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\">\n      <pre class=\"language-text\"><code class=\"language-text\">vagrant plugin install vagrant-notify</code></pre>\n      </div>\n<p>This piece will require another file called <code class=\"language-text\">notify-send</code>, preferably saved in <code class=\"language-text\">usr\\local\\bin</code></p>\n<div class=\"gatsby-highlight\" data-language=\"text\">\n      <pre class=\"language-text\"><code class=\"language-text\">terminal-notifier -appIcon &quot;$2&quot; -title &quot;$4&quot; -message &quot;$5&quot;</code></pre>\n      </div>\n<p>Make sure this file has no extension and is executable:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\">\n      <pre class=\"language-text\"><code class=\"language-text\">sudo chmod +x /usr/local/bin/notify-send</code></pre>\n      </div>\n<p>This is the part where I couldn’t quite get it to work like in the tutorial I included, so I ended up moving around the numbers that were being submitted to the script from gulp. These are the numbers that worked for me, YMMV. I believe the gulp-notify sends more by default now.</p>\n<h4>[3] Install Gulp, and dependencies</h4>\n<p>Used NPM for this on my Vagrant VM, since this is where gulp will be called:</p>\n<p>  npm install gulp —save-dev\nnpm install gulp-notify —save-dev\nnpm install gulp-phpunit —save-dev</p>\n<h4>[4] Create Gulp File</h4>\n<p>I gathered this from a couple of different gulp.js files.</p>\n<p>Note: Can be edited from host or guest machine, since in my case the gulp file will be at the base of my project folder.</p>\n<p>{% gist ca09db700169a0aac2af %}</p>\n<h4>[5] Check that it works</h4>\n<p>You can run <code class=\"language-text\">gulp</code>, or you can use <code class=\"language-text\">gulp test</code></p>\n<p>Which should return a notification of some sort. This will likely not be the best way to address phpunit tests, especially since currently there are only 3 tests. That’s not a lot, but if the project was much bigger, say 30-40 tests, I can see this being a dumb idea. I’ll likely not use this for larger projects, or at least implement a count that only runs the tests every so often.</p>\n<h2>Troubleshooting</h2>\n<p>The difficult part about this was getting the script to return the proper notifications. It initially wouldn’t give the message, and instead was using the default img that is included with the script. I ended up moving the numbers around and that seemed to address the issue.</p>","frontmatter":{"title":"Notifications Using Gulp-Notify on Vagrant with Terminal-Notifier","date":"September 08, 2014"}}},"pageContext":{"slug":"/use-gulp-notify-with-terminal-notifier/","previous":{"fields":{"slug":"/force-regeneration-on-jekyll-watch/"},"frontmatter":{"title":"Force regeneration on jekyll watch"}},"next":{"fields":{"slug":"/use-varnish-with-nginx-and-ubuntu/"},"frontmatter":{"title":"Use Varnish with Nginx and Ubuntu"}}}}